import 'package:flutter/material.dart';
import 'package:mutamaruna/core/constants.dart';
import 'package:mutamaruna/core/widgets/app_leading.dart';
import 'package:mutamaruna/core/widgets/derasetKetab_body.dart';

class Derasetketab3 extends StatelessWidget {
  const Derasetketab3({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        title: const Text(
          "اليوم الثالث",
          style: TextStyle(
              fontWeight: FontWeight.bold, color: Colors.white, fontSize: 25),
        ),
        backgroundColor: mainColor,
        leading: const AppLeading(),
      ),
      body: ListView(
        children: [
          Container(
            padding: const EdgeInsets.fromLTRB(0, 10, 0, 20),
            child: const Text(
              "اليوم الثالث حوش اللى وقع منك اخلاقيا ",
              textAlign: TextAlign.center,
              style: TextStyle(fontSize: 24, fontWeight: FontWeight.bold),
            ),
          ),
          const Derasetketabbody(
              title:
                  "١ - خطيئة داود مع بثشبع و قتل اوريا الحثى (2صم  11 : 1 - 18 )",
              body_details:
                  "1 وَكَانَ عِنْدَ تَمَامِ السَّنَةِ، فِي وَقْتِ خُرُوجِ الْمُلُوكِ، أَنَّ دَاوُدَ أَرْسَلَ يُوآبَ وَعَبِيدَهُ مَعَهُ وَجَمِيعَ إِسْرَائِيلَ، فَأَخْرَبُوا بَنِي عَمُّونَ وَحَاصَرُوا رِبَّةَ. وَأَمَّا دَاوُدُ فَأَقَامَ فِي أُورُشَلِيمَ. 2 وَكَانَ فِي وَقْتِ الْمَسَاءِ أَنَّ دَاوُدَ قَامَ عَنْ سَرِيرِهِ وَتَمَشَّى عَلَى سَطْحِ بَيْتِ الْمَلِكِ، فَرَأَى مِنْ عَلَى السَّطْحِ امْرَأَةً تَسْتَحِمُّ. وَكَانَتِ الْمَرْأَةُ جَمِيلَةَ الْمَنْظَرِ جِدًّا. 3 فَأَرْسَلَ دَاوُدُ وَسَأَلَ عَنِ الْمَرْأَةِ، فَقَالَ وَاحِدٌ: «أَلَيْسَتْ هذِهِ بَثْشَبَعَ بِنْتَ أَلِيعَامَ امْرَأَةَ أُورِيَّا الْحِثِّيِّ؟» 4 فَأَرْسَلَ دَاوُدُ رُسُلًا وَأَخَذَهَا، فَدَخَلَتْ إِلَيْهِ، فَاضْطَجَعَ مَعَهَا وَهِيَ مُطَهَّرَةٌ مِنْ طَمْثِهَا. ثُمَّ رَجَعَتْ إِلَى بَيْتِهَا. 5 وَحَبِلَتِ الْمَرْأَةُ، فَأَرْسَلَتْ وَأَخْبَرَتْ دَاوُدَ وَقَالَتْ: «إِنِّي حُبْلَى». 6 فَأَرْسَلَ دَاوُدُ إِلَى يُوآبَ يَقُولُ: «أَرْسِلْ إِلَيَّ أُورِيَّا الْحِثِّيَّ». فَأَرْسَلَ يُوآبُ أُورِيَّا إِلَى دَاوُدَ. 7 فَأَتَى أُورِيَّا إِلَيْهِ، فَسَأَلَ دَاوُدُ عَنْ سَلاَمَةِ يُوآبَ وَسَلاَمَةِ الشَّعْبِ وَنَجَاحِ الْحَرْبِ. 8 وَقَالَ دَاوُدُ لأُورِيَّا: «انْزِلْ إِلَى بَيْتِكَ وَاغْسِلْ رِجْلَيْكَ». فَخَرَجَ أُورِيَّا مِنْ بَيْتِ الْمَلِكِ، وَخَرَجَتْ وَرَاءَهُ حِصَّةٌ مِنْ عِنْدِ الْمَلِكِ. 9 وَنَامَ أُورِيَّا عَلَى بَابِ بَيْتِ الْمَلِكِ مَعَ جَمِيعِ عَبِيدِ سَيِّدِهِ، وَلَمْ يَنْزِلْ إِلَى بَيْتِهِ. 10 فأَخْبَرُوا دَاوُدَ قَائِلِينَ: «لَمْ يَنْزِلْ أُورِيَّا إِلَى بَيْتِهِ». فَقَالَ دَاوُدُ لأُورِيَّا: «أَمَا جِئْتَ مِنَ السَّفَرِ؟ فَلِمَاذَا لَمْ تَنْزِلْ إِلَى بَيْتِكَ؟» 11 فَقَالَ أُورِيَّا لِدَاوُدَ: «إِنَّ التَّابُوتَ وَإِسْرَائِيلَ وَيَهُوذَا سَاكِنُونَ فِي الْخِيَامِ، وَسَيِّدِي يُوآبُ وَعَبِيدُ سَيِّدِي نَازِلُونَ عَلَى وَجْهِ الصَّحْرَاءِ، وَأَنَا آتِي إِلَى بَيْتِي لآكُلَ وَأَشْرَبَ وَأَضْطَجعَ مَعَ امْرَأَتِي؟ وَحَيَاتِكَ وَحَيَاةِ نَفْسِكَ، لاَ أَفْعَلُ هذَا الأَمْرَ». 12 فَقَالَ دَاوُدُ لأُورِيَّا: «أَقِمْ هُنَا الْيَوْمَ أَيْضًا، وَغَدًا أُطْلِقُكَ». فَأَقَامَ أُورِيَّا فِي أُورُشَلِيمَ ذلِكَ الْيَوْمَ وَغَدَهُ. 13 وَدَعَاهُ دَاوُدُ فَأَكَلَ أَمَامَهُ وَشَرِبَ وَأَسْكَرَهُ. وَخَرَجَ عِنْدَ الْمَسَاءِ لِيَضْطَجِعَ فِي مَضْجَعِهِ مَعَ عَبِيدِ سَيِّدِهِ، وَإِلَى بَيْتِهِ لَمْ يَنْزِلْ. 14 وَفِي الصَّبَاحِ كَتَبَ دَاوُدُ مَكْتُوبًا إِلَى يُوآبَ وَأَرْسَلَهُ بِيَدِ أُورِيَّا. 15 وَكَتَبَ فِي الْمَكْتُوبِ يَقُولُ: «اجْعَلُوا أُورِيَّا فِي وَجْهِ الْحَرْبِ الشَّدِيدَةِ، وَارْجِعُوا مِنْ وَرَائِهِ فَيُضْرَبَ وَيَمُوتَ». 16 وَكَانَ فِي مُحَاصَرَةِ يُوآبَ الْمَدِينَةَ أَنَّهُ جَعَلَ أُورِيَّا فِي الْمَوْضِعِ الَّذِي عَلِمَ أَنَّ رِجَالَ الْبَأْسِ فِيهِ. 17 فَخَرَجَ رِجَالُ الْمَدِينَةِ وَحَارَبُوا يُوآبَ، فَسَقَطَ بَعْضُ الشَّعْبِ مِنْ عَبِيدِ دَاوُدَ، وَمَاتَ أُورِيَّا الْحِثِّيُّ أَيْضًا. 18 فَأَرْسَلَ يُوآبُ وَأَخْبَرَ دَاوُدَ بِجَمِيعِ أُمُورِ الْحَرْبِ"),
          Container(
            height: 40,
          ),
          const Derasetketabbody(
              title: "٢ ـ  سليمان ( انحرافه نحو الوثنيَّة) ( 1مل 11 : 1 - 12 )",
              body_details:
                  "1 وَأَحَبَّ الْمَلِكُ سُلَيْمَانُ نِسَاءً غَرِيبَةً كَثِيرَةً مَعَ بِنْتِ فِرْعَوْنَ: مُوآبِيَّاتٍ وَعَمُّونِيَّاتٍ وَأَدُومِيَّاتٍ وَصِيدُونِيَّاتٍ وَحِثِّيَّاتٍ. 2 مِنَ الأُمَمِ الَّذِينَ قَالَ عَنْهُمُ الرَّبُّ لِبَنِي إِسْرَائِيلَ: «لاَ تَدْخُلُونَ إِلَيْهِمْ وَهُمْ لاَ يَدْخُلُونَ إِلَيْكُمْ، لأَنَّهُمْ يُمِيلُونَ قُلُوبَكُمْ وَرَاءَ آلِهَتِهِمْ». فَالْتَصَقَ سُلَيْمَانُ بِهؤُلاَءِ بِالْمَحَبَّةِ. 3 وَكَانَتْ لَهُ سَبْعُ مِئَةٍ مِنَ النِّسَاءِ السَّيِّدَاتِ، وَثَلاَثُ مِئَةٍ مِنَ السَّرَارِيِّ، فَأَمَالَتْ نِسَاؤُهُ قَلْبَهُ. 4 وَكَانَ فِي زَمَانِ شَيْخُوخَةِ سُلَيْمَانَ أَنَّ نِسَاءَهُ أَمَلْنَ قَلْبَهُ وَرَاءَ آلِهَةٍ أُخْرَى، وَلَمْ يَكُنْ قَلْبُهُ كَامِلًا مَعَ الرَّبِّ إِلهِهِ كَقَلْبِ دَاوُدَ أَبِيهِ. 5 فَذَهَبَ سُلَيْمَانُ وَرَاءَ عَشْتُورَثَ إِلهَةِ الصِّيدُونِيِّينَ، وَمَلْكُومَ رِجْسِ الْعَمُّونِيِّينَ. 6 وَعَمِلَ سُلَيْمَانُ الشَّرَّ فِي عَيْنَيِ الرَّبِّ، وَلَمْ يَتْبَعِ الرَّبَّ تَمَامًا كَدَاوُدَ أَبِيهِ. 7 حِينَئِذٍ بَنَى سُلَيْمَانُ مُرْتَفَعَةً لِكَمُوشَ رِجْسِ الْمُوآبِيِّينَ عَلَى الْجَبَلِ الَّذِي تُجَاهَ أُورُشَلِيمَ، وَلِمُولَكَ رِجْسِ بَنِي عَمُّونَ 8 وَهكَذَا فَعَلَ لِجَمِيعِ نِسَائِهِ الْغَرِيبَاتِ اللَّوَاتِي كُنَّ يُوقِدْنَ وَيَذْبَحْنَ لآلِهَتِهِنَّ. 9 فَغَضِبَ الرَّبُّ عَلَى سُلَيْمَانَ لأَنَّ قَلْبَهُ مَالَ عَنِ الرَّبِّ إِلهِ إِسْرَائِيلَ الَّذِي تَرَاءَى لَهُ مَرَّتَيْنِ، 10 وَأَوْصَاهُ فِي هذَا الأَمْرِ أَنْ لاَ يَتَّبعَ آلِهَةً أُخْرَى، فَلَمْ يَحْفَظْ مَا أَوْصَى بِهِ الرَّبُّ. 11 فَقَالَ الرَّبُّ لِسُلَيْمَانَ: «مِنْ أَجْلِ أَنَّ ذلِكَ عِنْدَكَ، وَلَمْ تَحْفَظْ عَهْدِي وَفَرَائِضِيَ الَّتِي أَوْصَيْتُكَ بِهَا، فَإِنِّي أُمَزِّقُ الْمَمْلَكَةَ عَنْكَ تَمْزِيقًا وَأُعْطِيهَا لِعَبْدِكَ. 12 إِلاَّ إِنِّي لاَ أَفْعَلُ ذلِكَ فِي أَيَّامِكَ، مِنْ أَجْلِ دَاوُدَ أَبِيكَ، بَلْ مِنْ يَدِ ابْنِكَ أُمَزِّقُهَا.")
        ],
      ),
    );
  }
}
