import 'package:flutter/material.dart';
import 'package:mutamaruna/core/constants.dart';
import 'package:mutamaruna/core/widgets/derasetKetab_body.dart';

class Derasetketab2 extends StatelessWidget {
  const Derasetketab2({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text(
          "اليوم الثانى",
          style: TextStyle(fontWeight: FontWeight.bold, color: Colors.white),
        ),
        backgroundColor: mainColor,
      ),
      body: ListView(
        children: [
          Container(
            padding: const EdgeInsets.fromLTRB(0, 10, 0, 20),
            child: const Text(
              "اليوم الثانى : حوش اللى وقع منك اجتماعيا ",
              textAlign: TextAlign.center,
              style: TextStyle(fontSize: 24, fontWeight: FontWeight.bold),
            ),
          ),
          const Derasetketabbody(
            title: "١ - راحيل و ليئه ( تكوين 30 : 1 - 24 )",
            body_details:
                "1 فَلَمَّا رَأَتْ رَاحِيلُ أَنَّهَا لَمْ تَلِدْ لِيَعْقُوبَ، غَارَتْ رَاحِيلُ مِنْ أُخْتِهَا، وَقَالَتْ لِيَعْقُوبَ: «هَبْ لِي بَنِينَ، وَإِلاَّ فَأَنَا أَمُوتُ!» 2 فَحَمِيَ غَضَبُ يَعْقُوبَ عَلَى رَاحِيلَ وَقَالَ: «أَلَعَلِّي مَكَانَ اللهِ الَّذِي مَنَعَ عَنْكِ ثَمْرَةَ الْبَطْنِ؟» 3 فَقَالَتْ: «هُوَذَا جَارِيَتِي بِلْهَةُ، ادْخُلْ عَلَيْهَا فَتَلِدَ عَلَى رُكْبَتَيَّ، وَأُرْزَقُ أَنَا أَيْضًا مِنْهَا بَنِينَ». 4 فَأَعْطَتْهُ بِلْهَةَ جَارِيَتَهَا زَوْجَةً، فَدَخَلَ عَلَيْهَا يَعْقُوبُ، 5 فَحَبِلَتْ بِلْهَةُ وَوَلَدَتْ لِيَعْقُوبَ ابْنًا، 6 فَقَالَتْ رَاحِيلُ: «قَدْ قَضَى لِيَ اللهُ وَسَمِعَ أَيْضًا لِصَوْتِي وَأَعْطَانِيَ ابْنًا». لِذلِكَ دَعَتِ اسْمَهُ «دَانًا». 7  وَحَبِلَتْ أَيْضًا بِلْهَةُ جَارِيَةُ رَاحِيلَ وَوَلَدَتِ ابْنًا ثَانِيًا لِيَعْقُوبَ، 8  فَقَالَتْ رَاحِيلُ: «مُصَارَعَاتِ اللهِ قَدْ صَارَعْتُ أُخْتِي وَغَلَبْتُ». فَدَعَتِ اسْمَهُ «نَفْتَالِي». 9 وَلَمَّا رَأَتْ لَيْئَةُ أَنَّهَا تَوَقَّفَتْ عَنِ الْوِلاَدَةِ، أَخَذَتْ زِلْفَةَ جَارِيَتَهَا وَأَعْطَتْهَا لِيَعْقُوبَ زَوْجَةً، 10 فَوَلَدَتْ زِلْفَةُ جَارِيَةُ لَيْئَةَ لِيَعْقُوبَ ابْنًا. 11 فَقَالَتْ لَيْئَةُ: «بِسَعْدٍ». فَدَعَتِ اسْمَهُ «جَادًا». 12 وَوَلَدَتْ زِلْفَةُ جَارِيَةُ لَيْئَةَ ابْنًا ثَانِيًا لِيَعْقُوبَ، 13 فَقَالَتْ لَيْئَةُ: «بِغِبْطَتِي، لأَنَّهُ تُغَبِّطُنِي بَنَاتٌ». فَدَعَتِ اسْمَهُ «أَشِيرَ». 14 وَمَضَى رَأُوبَيْنُ فِي أَيَّامِ حَصَادِ الْحِنْطَةِ فَوَجَدَ لُفَّاحًا فِي الْحَقْلِ وَجَاءَ بِهِ إِلَى لَيْئَةَ أُمِّهِ. فَقَالَتْ رَاحِيلُ لِلَيْئَةَ: «أَعْطِينِي مِنْ لُفَّاحِ ابْنِكِ». 15 فَقَالَتْ لَهَا: «أَقَلِيلٌ أَنَّكِ أَخَذْتِ رَجُلِي فَتَأْخُذِينَ لُفَّاحَ ابْنِي أَيْضًا؟» فَقَالَتْ رَاحِيلُ: «إِذًا يَضْطَجعُ مَعَكِ اللَّيْلَةَ عِوَضًا عَنْ لُفَّاحِ ابْنِكِ». 16 فَلَمَّا أَتَى يَعْقُوبُ مِنَ الْحَقْلِ فِي الْمَسَاءِ، خَرَجَتْ لَيْئَةُ لِمُلاَقَاتِهِ وَقَالَتْ: «إِلَيَّ تَجِيءُ لأَنِّي قَدِ اسْتَأْجَرْتُكَ بِلُفَّاحِ ابْنِي». فَاضْطَجَعَ مَعَهَا تِلْكَ اللَّيْلَةَ. 17 وَسَمِعَ اللهُ لِلَيْئَةَ فَحَبِلَتْ وَوَلَدَتْ لِيَعْقُوبَ ابْنًا خَامِسًا. 18 فَقَالَتْ لَيْئَةُ: «قَدْ أَعْطَانِي اللهُ أُجْرَتِي، لأَنِّي أَعْطَيْتُ جَارِيَتِي لِرَجُلِي». فَدَعَتِ اسْمَهُ «يَسَّاكَرَ». 19 وَحَبِلَتْ أَيْضًا لَيْئَةُ وَوَلَدَتِ ابْنًا سَادِسًا لِيَعْقُوبَ، 20 فَقَالَتْ لَيْئَةُ: «قَدْ وَهَبَنِي اللهُ هِبَةً حَسَنَةً. الآنَ يُسَاكِنُنِي رَجُلِي، لأَنِّي وَلَدْتُ لَهُ سِتَّةَ بَنِينَ». فَدَعَتِ اسْمَهُ «زَبُولُونَ». 21 ثُمَّ وَلَدَتِ ابْنَةً وَدَعَتِ اسْمَهَا «دِينَةَ». 22 وَذَكَرَ اللهُ رَاحِيلَ، وَسَمِعَ لَهَا اللهُ وَفَتَحَ رَحِمَهَا، 23 فَحَبِلَتْ وَوَلَدَتِ ابْنًا فقالت: «قَدْ نَزَعَ اللهُ عَارِي». 24 وَدَعَتِ اسْمَهُ «يُوسُفَ» قَائِلَةً: «يَزِيدُنِي الرَّبُّ ابْنًا آخَرَ",
          ),
          Container(
            height: 40,
          ),
          const Derasetketabbody(
            title: "٢ ـ راعوث و نعمه (راعوث 1 : 1- 18)",
            body_details:
                "1 حَدَثَ فِي أَيَّامِ حُكْمِ الْقُضَاةِ أَنَّهُ صَارَ جُوعٌ فِي الأَرْضِ، فَذَهَبَ رَجُلٌ مِنْ بَيْتِ لَحْمِ يَهُوذَا لِيَتَغَرَّبَ فِي بِلاَدِ مُوآبَ هُوَ وَامْرَأَتُهُ وَابْنَاهُ. 2 وَاسْمُ الرَّجُلِ أَلِيمَالِكُ، وَاسْمُ امْرَأَتِهِ نُعْمِي، وَاسْمَا ابْنَيْهِ مَحْلُونُ وَكِلْيُونُ، أَفْرَاتِيُّونَ مِنْ بَيْتِ لَحْمِ يَهُوذَا. فَأَتَوْا إِلَى بِلاَدِ مُوآبَ وَكَانُوا هُنَاكَ. 3 وَمَاتَ أَلِيمَالِكُ رَجُلُ نُعْمِي، وَبَقِيَتْ هِيَ وَابْنَاهَا. 4 فَأَخَذَا لَهُمَا امْرَأَتَيْنِ مُوآبِيَّتَيْنِ، اسْمُ إِحْدَاهُمَا عُرْفَةُ وَاسْمُ الأُخْرَى رَاعُوثُ. وَأَقَامَا هُنَاكَ نَحْوَ عَشَرِ سِنِينٍ. 5 ثُمَّ مَاتَا كِلاَهُمَا مَحْلُونُ وَكِلْيُونُ، فَتُرِكَتِ الْمَرْأَةُ مِنِ ابْنَيْهَا وَمِنْ رَجُلِهَا. 6 فَقَامَتْ هِيَ وَكَنَّتَاهَا وَرَجَعَتْ مِنْ بِلاَدِ مُوآبَ، لأَنَّهَا سَمِعَتْ فِي بِلاَدِ مُوآبَ أَنَّ الرَّبَّ قَدِ افْتَقَدَ شَعْبَهُ لِيُعْطِيَهُمْ خُبْزًا. 7 وَخَرَجَتْ مِنَ الْمَكَانِ الَّذِي كَانَتْ فِيهِ وَكَنَّتَاهَا مَعَهَا، وَسِرْنَ فِي الطَّرِيقِ لِلرُّجُوعِ إِلَى أَرْضِ يَهُوذَا. 8 فَقَالَتْ نُعْمِي لِكَنَّتَيْهَا: «اذْهَبَا ارْجِعَا كُلُّ وَاحِدَةٍ إِلَى بَيْتِ أُمِّهَا. وَلْيَصْنَعِ الرَّبُّ مَعَكُمَا إِحْسَانًا كَمَا صَنَعْتُمَا بِالْمَوْتَى وَبِي. 9 وَلْيُعْطِكُمَا الرَّبُّ أَنْ تَجِدَا رَاحَةً كُلُّ وَاحِدَةٍ فِي بَيْتِ رَجُلِهَا». فَقَبَّلَتْهُمَا، وَرَفَعْنَ أَصْوَاتَهُنَّ وَبَكَيْنَ. 10 فَقَالَتَا لَهَا: «إِنَّنَا نَرْجعُ مَعَكِ إِلَى شَعْبِكِ». 11 فَقَالَتْ نُعْمِي: «ارْجِعَا يَا بِنْتَيَّ. لِمَاذَا تَذْهَبَانِ مَعِي؟ هَلْ فِي أَحْشَائِي بَنُونَ بَعْدُ حَتَّى يَكُونُوا لَكُمَا رِجَالًا؟ 12 اِرْجِعَا يَا بِنْتَيَّ وَاذْهَبَا لأَنِّي قَدْ شِخْتُ عَنْ أَنْ أَكُونَ لِرَجُل. وَإِنْ قُلْتُ لِي رَجَاءٌ أَيْضًا بِأَنِّي أَصِيرُ هذِهِ اللَّيْلَةَ لِرَجُل وَأَلِدُ بَنِينَ أَيْضًا، 13 هَلْ تَصْبِرَانِ لَهُمْ حَتَّى يَكْبُرُوا؟ هَلْ تَنْحَجِزَانِ مِنْ أَجْلِهِمْ عَنْ أَنْ تَكُونَا لِرَجُل؟ لاَ يَا بِنْتَيَّ. فَإِنِّي مَغْمُومَةٌ جِدًّا مِنْ أَجْلِكُمَا لأَنَّ يَدَ الرَّبِّ قَدْ خَرَجَتْ عَلَيَّ». 14 ثُمَّ رَفَعْنَ أَصْوَاتَهُنَّ وَبَكَيْنَ أَيْضًا. فَقَبَّلَتْ عُرْفَةُ حَمَاتَهَا، وَأَمَّا رَاعُوثُ فَلَصِقَتْ بِهَا. 15 فَقَالَتْ: «هُوَذَا قَدْ رَجَعَتْ سِلْفَتُكِ إِلَى شَعْبِهَا وَآلِهَتِهَا. اِرْجِعِي أَنْتِ وَرَاءَ سِلْفَتِكِ». 16 فَقَالَتْ رَاعُوثُ: «لاَ تُلِحِّي عَلَيَّ أَنْ أَتْرُكَكِ وَأَرْجعَ عَنْكِ، لأَنَّهُ حَيْثُمَا ذَهَبْتِ أَذْهَبُ وَحَيْثُمَا بِتِّ أَبِيتُ. شَعْبُكِ شَعْبِي وَإِلهُكِ إِلهِي. 17 حَيْثُمَا مُتِّ أَمُوتُ وَهُنَاكَ أَنْدَفِنُ. هكَذَا يَفْعَلُ الرَّبُّ بِي وَهكَذَا يَزِيدُ. إِنَّمَا الْمَوْتُ يَفْصِلُ بَيْنِي وَبَيْنَكِ». 18 فَلَمَّا رَأَتْ أَنَّهَا مُشَدِّدَةٌ عَلَى الذَّهَابِ مَعَهَا، كَفَّتْ عَنِ الْكَلاَمِ إِلَيْهَا.",
          )
        ],
      ),
    );
  }
}
